[
  {
    "joke": "Why do programmers prefer dark mode? Because light attracts bugs."
  },
  {
    "joke": "I told my computer I needed a break, and it said: 'I can't handle your requests right now'."
  },
  {
    "joke": "Why do Java developers wear glasses? Because they don't see sharp."
  },
  {
    "joke": "What's a programmer's favorite hangout place? The Foo Bar."
  },
  {
    "joke": "Why was the JavaScript developer sad? Because he didn't know how to 'null' his feelings."
  },
  {
    "joke": "Why do Python devs hate snakes? Because they prefer indentation to fangs."
  },
  {
    "joke": "Why did the CSS developer go broke? Because he used too many margins."
  },
  {
    "joke": "How do you comfort a JavaScript bug? You console it."
  },
  {
    "joke": "Why did the coder quit his job? Because he didn’t get arrays."
  },
  {
    "joke": "There are only 10 types of people in the world: those who understand binary and those who don't."
  },
  {
    "joke": "Why did the computer date the router? Because it found a strong connection."
  },
  { "joke": "Why don’t programmers like to go outside? The sunlight causes too many glares on their screens." },
  { "joke": "How do you scare a programmer? Say: 'Production bug'." },
  { "joke": "Why did the developer fail the interview? He couldn’t get past the class." },
  { "joke": "Why do backend developers make terrible DJs? They can't drop the bass." },
  { "joke": "Why did the JavaScript file go to therapy? It had too many unresolved issues." },
  { "joke": "Why was the IDE acting weird? It had too many extensions enabled." },
  { "joke": "Why did the web developer go broke? Because he kept using free and open-source software." },
  { "joke": "Why did the UX designer leave the party early? It wasn’t user-friendly." },
  { "joke": "Why couldn’t the string stop dating the array? Because it was in a relationship." },
  { "joke": "Why did the IT guy bring a ladder to work? Because the network was down." },
  { "joke": "Why did the code take forever to execute? It was waiting for a callback." },
  { "joke": "What did the CSS file say to the HTML file? 'You look a little plain today.'" },
  { "joke": "Why was the software so clingy? It didn’t want to be deprecated." },
  { "joke": "Why did the programmer bring a jacket to the server room? Because it was freezing!" },
  { "joke": "Why was the network admin always calm? He had excellent control." },
  { "joke": "Why do developers always mix up Halloween and Christmas? Because Oct 31 equals Dec 25." },
  { "joke": "Why was the JavaScript function feeling lost? It didn’t know its scope." },
  { "joke": "Why did the dev refuse to go on a date? He had a lot of 'commit' issues." },
  { "joke": "Why did the bug cry? It couldn’t reproduce the problem." },
  { "joke": "Why do programmers hate elevators? Too many levels of abstraction." },
  { "joke": "Why was the code so clean? It passed all linting checks." },
  { "joke": "Why did the dev bring snacks to the meeting? Because it was a scrum." },
  { "joke": "Why did the software engineer cross the road? To escape the infinite loop." },
  { "joke": "Why don’t coders argue with designers? They know better than to challenge styles." },
  { "joke": "Why do developers prefer keyboards over mice? Because they hate clickbait." },
  { "joke": "Why did the site crash on launch day? It couldn’t handle the hype." },
  { "joke": "Why did the API feel unappreciated? No one ever gave it headers." },
  { "joke": "Why couldn’t the terminal find love? Because it always typed 'sudo alone'." },
  { "joke": "Why did the hacker get caught? He left his fingerprint in the commit history." },
  { "joke": "Why don’t arrays gossip? They don’t want to be spread." }
]